read-load-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 100
      arrivalRate: 10
      rampTo: 100
  payload:
    path: "keys.csv"
    fields:
      - "shortenUrlKey"

scenarios:
  - flow:
      - get:
          # path variable
          url: "/{{ shortenUrlKey }}"
          followRedirect: false # 해당 요청에 대한 응답이 301 리다이렉트 되기 때문에 이 작업을 방지